mrsgit09Docset0516221715/articles/MS-SSAS/6828da75-11b9-4617-a572-dbf632bce5b4.md

<html dir="LTR" xmlns:mshelp="http://msdn.microsoft.com/mshelp" xmlns:ddue="http://ddue.schemas.microsoft.com/authoring/2003/5" xmlns:xlink="http://www.w3.org/1999/xlink" xmlns:tool="http://www.microsoft.com/tooltip">
    <head>
        <meta http-equiv="Content-Type" content="text/html; CHARSET=utf-8"></meta>
        <meta name="save" content="history"></meta>
        <title>4.10.1 Client Sends Request</title>
        <xml>
            <mshelp:toctitle title="4.10.1 Client Sends Request"></mshelp:toctitle>
            <mshelp:rltitle title="[MS-SSAS]: Client Sends Request"></mshelp:rltitle>
            <mshelp:keyword index="A" term="6828da75-11b9-4617-a572-dbf632bce5b4"></mshelp:keyword>
            <mshelp:attr name="DCSext.ContentType" value="open specification"></mshelp:attr>
            <mshelp:attr name="AssetID" value="6828da75-11b9-4617-a572-dbf632bce5b4"></mshelp:attr>
            <mshelp:attr name="TopicType" value="kbRef"></mshelp:attr>
            <mshelp:attr name="DCSext.Title" value="[MS-SSAS]: Client Sends Request" />
        </xml>
    </head>
    <body>
        <div id="header">
            <h1 class="heading">4.10.1 Client Sends Request</h1>
        </div>
        <div id="mainSection">
            <div id="mainBody">
                <div id="allHistory" class="saveHistory"></div>
                <div id="sectionSection0" class="section" name="collapseableSection">
                    

<p>The client sends the following request:</p>

<dl>
<dd>
<div><pre> &lt;Envelope xmlns=&quot;http://schemas.xmlsoap.org/soap/envelope/&quot;&gt;
   &lt;Body&gt;
     &lt;Discover xmlns=&quot;urn:schemas-microsoft-com:xml-analysis&quot;&gt;
       &lt;RequestType&gt;DISCOVER_TRACE_DEFINITION_PROVIDERINFO&lt;/RequestType&gt;
       &lt;Restrictions&gt;
         &lt;RestrictionList&gt;&lt;/RestrictionList&gt;
       &lt;/Restrictions&gt;
       &lt;Properties&gt;
         &lt;PropertyList&gt;
           &lt;Catalog&gt;Adventure Works DW 2008&lt;/Catalog&gt;
         &lt;/PropertyList&gt;
       &lt;/Properties&gt;
     &lt;/Discover&gt;
   &lt;/Body&gt;
 &lt;/Envelope&gt;
</pre></div>
</dd></dl>


                </div>
            </div>
        </div>
    </body>
</html>